<a href="https://colab.research.google.com/github/lfilipeAndrade/Pandas/blob/main/01-Manipula%C3%A7%C3%A3o_de_dados_com_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Manipulação de dados com Pandas

**Estruturas de dados com Pandas**
 
pandas.Series() - 1 Dimenssão - 1D
 
pandas.DataFrame() - 2 Dimenssões - 2D
 
pandas.Panel() - 3 Dimenssões - 3D
 
numpy.ndarray() - x Dimenssões

## Series

In [1]:
import pandas as pd
import numpy as np

### Usando o Numpy ndarray como fonte

In [2]:
# random.seed garantirá que mesmo que executa várias vezes esta celula o valor random gerado não mudará
np.random.seed(100)
Serie1 = pd.Series(np.random.rand(10))

In [3]:
Serie1

0    0.543405
1    0.278369
2    0.424518
3    0.844776
4    0.004719
5    0.121569
6    0.670749
7    0.825853
8    0.136707
9    0.575093
dtype: float64

In [ ]:
type(Serie1)

pandas.core.series.Series

In [ ]:
import calendar as cal

In [ ]:
meses = [cal.month_name[i] for i in np.arange(1,13)]
meses_serie = pd.Series(np.arange(1,13),index = meses) # Criando um serie pandas de 1 até 12 e usando a lista meses como indece 
meses_serie

January       1
February      2
March         3
April         4
May           5
June          6
July          7
August        8
September     9
October      10
November     11
December     12
dtype: int64

In [ ]:
meses_serie.index

Index(['January', 'February', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype='object')

### Usando Dicionários Python

In [ ]:
stockPrices = {'GOOG':1092.62, 'FB':1522.01, 'TWTR':225.18, 'AMZN':852.69,'AAPL':301.60}

In [ ]:
stockPrices_series = pd.Series(stockPrices,
                               index = ['AAPL','FB','YHOO','TWTR','AMZN','GOOG','BIDI4'],
                               name = 'stockPrices')

In [ ]:
stockPrices_series

AAPL      301.60
FB       1522.01
YHOO         NaN
TWTR      225.18
AMZN      852.69
GOOG     1092.62
BIDI4        NaN
Name: stockPrices, dtype: float64

### Usando valores escalares

In [ ]:
humanSeries = pd.Series('Homem',index=['cabeça','braços','Ombros','pescoço','pernas'], name= 'corpo humano')
humanSeries

cabeça     Homem
braços     Homem
Ombros     Homem
pescoço    Homem
pernas     Homem
Name: corpo humano, dtype: object

### Operações com Series

In [ ]:
# Alterando um elemento da série
stockPrices_series['GOOG'] = 1100.02
stockPrices_series

AAPL      301.60
FB       1522.01
YHOO         NaN
TWTR      225.18
AMZN      852.69
GOOG     1100.02
BIDI4        NaN
Name: stockPrices, dtype: float64

In [ ]:
# Retornar apenas o indice selecionado
stockPrices_series['AAPL']

301.6

In [ ]:
# Procurar um valor de indice na serie, se não encontrar, retornar NaN
stockPrices_series.get('XPTO', np.NaN)

nan

### Slicing

In [ ]:
stockPrices_series[:2]

AAPL     301.60
FB      1522.01
Name: stockPrices, dtype: float64

In [ ]:
stockPrices_series[stockPrices_series > 1000]

FB      1522.01
GOOG    1100.02
Name: stockPrices, dtype: float64

## DataFrames

In [ ]:
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price','EPS','Shares Outstanding(M)', 
                                  'Beta', 'P/E','Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'Beta','P/E','Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E','Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                            index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                  'Market Cap(B)','Beta'])}

In [ ]:
stock

{'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64, 'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64, 'FB': Closing price              61.48
 EPS                         0.59
 Shares Outstanding(M)    2450.00
 P/E                       104.93
 Market Cap(B)             150.92
 dtype: float64, 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64, 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64, 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64}

In [ ]:
stock['GOOG']['EPS']

36.05

In [ ]:
stock_df = pd.DataFrame(stock)
stock_df

                         AMZN     GOOG       FB     YHOO    TWTR    AAPL
Beta                     0.52     0.87      NaN     0.66     NaN    0.84
Closing price          346.15  1133.43    61.48    34.90   65.25  501.53
EPS                      0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)          158.88   380.64   150.92    35.36   36.23  447.59
P/E                    589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)  459.00   335.83  2450.00  1010.00  555.20  892.45

In [ ]:
stock_df = pd.DataFrame(stock, 
                        index = 
                        ['Beta','Closing price','EPS','Market Cap(B)','P/E','Shares Outstanding(M)'],
                        columns = 
                        ['AMZN','GOOG','FB'])

In [ ]:
# Método que retorna os índices do df
stock_df.index

Index(['Beta', 'Closing price', 'EPS', 'Market Cap(B)', 'P/E',
       'Shares Outstanding(M)'],
      dtype='object')

In [ ]:
# Método que retorna as colunas do df
stock_df.columns

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

In [ ]:
# A propriedade pandas.DataFrame.T é usada para transpor o índice e as colunas do quadro de dados. 
# Está de alguma forma relacionada ao método transpose ().
stock_df.T

      Beta  Closing price    EPS  Market Cap(B)     P/E  Shares Outstanding(M)
AMZN  0.52         346.15   0.59         158.88  589.80                 459.00
GOOG  0.87        1133.43  36.05         380.64   31.44                 335.83
FB     NaN          61.48   0.59         150.92  104.93                2450.00

### Operações com DataFrames

In [33]:
# Dicionários aninhados
Quadro_Medalhas_Rio_2016 = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [41]:
# Usando a função from_dict do pandas.Dataframe para transformar um dicionário em Dataframe do pandas
rio_2016 = pd.DataFrame.from_dict(Quadro_Medalhas_Rio_2016)
rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [6]:
# FilAtribuindo a uma variável apenas apenas a coluna 'China' do df
medalhas_china = rio_2016['China']
medalhas_china

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [7]:
medalhas_euro = rio_2016[['Britain','Germany']]; medalhas_euro

        Britain  Germany
Ouro         27       17
Prata        23       10
Bronze       17       15

In [8]:
rio_2016.get('Germany')

Ouro      17
Prata     10
Bronze    15
Name: Germany, dtype: int64

In [18]:
rio_2016.loc['Prata','Germany']

10

In [25]:
# Filtrando apenas as colunas onde Ouro > 20
rio_2016.loc[:,rio_2016.loc['Ouro']>20]

        USA  China  Britain
Ouro     46     26       27
Prata    37     18       23
Bronze   38     26       17

In [26]:
rio_2016.iloc[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [29]:
rio_2016.iloc[2,0:3]

USA        38
China      26
Britain    17
Name: Bronze, dtype: int64

### Removendo um membro do DataFrame

In [42]:
del rio_2016['USA']
rio_2016

        China  Britain  Russe  Germany
Ouro       26       27     19       17
Prata      18       23     18       10
Bronze     26       17     19       15

### Inserindo membros

In [43]:
# O primeiro argumento do .insert é a posição de inserção da nova coluna, nome e por último os valores para cada linha
rio_2016.insert(1,'Brazil',(7,6,6))
rio_2016

        China  Brazil  Britain  Russe  Germany
Ouro       26       7       27     19       17
Prata      18       6       23     18       10
Bronze     26       6       17     19       15

In [44]:
rio_2016.describe()

           China    Brazil    Britain      Russe    Germany
count   3.000000  3.000000   3.000000   3.000000   3.000000
mean   23.333333  6.333333  22.333333  18.666667  14.000000
std     4.618802  0.577350   5.033223   0.577350   3.605551
min    18.000000  6.000000  17.000000  18.000000  10.000000
25%    22.000000  6.000000  20.000000  18.500000  12.500000
50%    26.000000  6.000000  23.000000  19.000000  15.000000
75%    26.000000  6.500000  25.000000  19.000000  16.000000
max    26.000000  7.000000  27.000000  19.000000  17.000000